#pragma once
#include <string>
#include <vector>

struct Citation{
	std::vector<std::wstring> arr_string = {
		L"Ничто так не выдает принадлежность человека к низшим классам общества, как способность разбираться в дорогих часах и автомобилях",
		L"Находясь в жопе, ты можешь сделать две вещи. Во-первых - постараться понять, почему ты в ней находишься."
		 " Во-вторых - вылезти оттуда... Вылезти из жопы надо всего один раз, и после этого про нее можно забыть."
		 " А чтобы понять, почему ты в ней находишься, нужна вся жизнь. Которую ты в ней и проведешь.",
		L"Вера, которую не разделяет никто, называется шизофренией",
		L"Телевизор – это просто маленькое прозрачное окошко в трубе духовного мусоропровода",
		L"Антирусский заговор, безусловно, существует – проблема только в том, что в нем участвует все взрослое население России",
		L"- А голова твоя где ? -На плечах. - А плечи где ? -В комнате. - А где комната ? -В доме. - А дом ? -В России."
		"- А Россия где ? -В беде, Василий Иванович.", 
		L"Когда не думаешь, многое становится ясно",
		L"Все, чем занимаются люди, настолько безобразно, что нет никакой разницы, на чьей ты стороне.",
		L"Не забивайте себе голову тем, что не имеет отношения к настоящему. В будущее надо ещё суметь попасть",
		L"В наше время люди узнают о том, что они думают, по телевизору",
		L"Мы любим вовсе не тех, кто сделал нам что-то хорошее. Мы любим тех, кому сделали что-то хорошее мы сами."
		"И чем больше хорошего мы им сделали, тем больше хотим сделать еще",
		L"Ценность книги определяется не тем, сколько человек ее прочтет.У величайших книг мало читателей, потому что их чтение требует усилия."
		" Но именно из-за этого усилия и рождается эстетический эффект. Литературный фаст-фуд никогда не подарит тебе ничего подобного.",
		L"Единственный путь к бессмертию для капли воска, это перестать считать, что она капля, и понять, что она и есть воск."
		" Но поскольку наша капля сама способна заметить только свою форму, она всю свою короткую жизнь молится Господу Воску"
		" о спасении этой формы, хотя эта форма, если вдуматься, не имеет к ней никакого отношения",
		L"Действительно, многие миллионеры ходят в рванье и ездят на дешевых машинах - но, чтобы позволить себе это, надо быть миллионером."
		" Нищий в такой ситуации невыразимо страдал бы от когнитивного диссонанса, поэтому многие бедные люди стремятся дорого и хорошо одеться"
		" на последние деньги",
		L"…С возрастом я понял, что на самом деле слова «прийти в себя» означают «прийти к другим», потому что именно эти другие"
		" с рождения объясняют тебе, какие усилия ты должен проделать над собой, чтобы принять угодную им форму",
		L"Человек считает себя Богом, и он прав, потому что Бог в нем есть. Считает себя свиньей — и опять прав, потому что свинья в нем тоже есть."
		"Но человек очень ошибается, когда принимает свою внутреннюю свинью за Бога",
		L"Смайлик - это визуальный дезодорант. Его обычно ставят, когда юзеру кажется, что от него плохо пахнет."
		" И он хочет гарантированно пахнуть хорошо",
		L"Если ты оказался в темноте и видишь хотя бы самый слабый луч света, ты должен идти к нему, вместо того, чтобы рассуждать,"
		" имеет смысл это делать или нет. Может, это действительно не имеет смысла. Но просто сидеть в темноте не имеет смысла в любом случае. "
		"Понимаешь, в чем разница?",
		L"Не ищи во всем символического значения, а то ведь найдешь. На свою голову",
		L"...и он с грустью подумал, что Россия, в сущности, тоже страна восходящего солнца - хотя бы потому, что оно над ней так ни разу"
		" по-настоящему и не взошло до конца.",
		L"Когда человек ищет, чем подтвердить свои параноидальные идеи, он всегда находит",
		L"Протяженность человеческой жизни была рассчитана таким образом, чтобы люди не успевали сделать серьезных выводов из происходящего",
		L"Улыбайся всем как можно шире - они должны быть уверены, что ты холодная лицемерная сволочь.",
		L"Женщина — это волшебный цветок, при взгляде на который с вами должно случиться умопомешательство, достаточно сильное для того,"
		" чтобы подвигнуть вас на тяготы деторождения",
		L"- ... Не бойся показаться дураком. Наоборот, бойся показаться умным. - Почему? - Потому что тогда немедленно возникнет вопрос:"
		" если ты такой умный, то почему ты нанимаешься на работу, а не нанимаешь на нее?",
		L"...много золота на шее и руках – это признак не столько богатства, сколько уязвленной нищеты",
		L"Человек всегда выходит в сеть с предвкушением, что он сейчас выловит из океана информации нечто ценное, интересное и нужное."
		" И что происходит через три-четыре часа? Он встаёт из-за монитора с чувством, что через его душу пронеслось стадо свиней."
	};
};